package test_for_matlab

fun main() {
    var text =
            "            2       3.8529      -1.5779            0            0            0            0\n" +
            "            4       2.9348     -0.65978     -0.91816     -0.91816            0            0\n" +
            "            8       2.5637      -0.2887     -0.37107     -0.37107      0.40415       -1.307\n" +
            "           16       2.4082     -0.13324     -0.15546     -0.15546      0.41894      -1.2552\n" +
            "           32       2.3388    -0.063788    -0.069455    -0.069455      0.44678      -1.1624\n" +
            "           64       2.3062    -0.031182    -0.032606    -0.032606      0.46945      -1.0909\n" +
            "          128       2.2904    -0.015413    -0.015769    -0.015769      0.48363       -1.048\n" +
            "          256       2.2827   -0.0076617   -0.0077509   -0.0077509      0.49152      -1.0247\n" +
            "          512       2.2788   -0.0038197    -0.003842    -0.003842      0.49569      -1.0125\n" +
            "         1024       2.2769   -0.0019071   -0.0019127   -0.0019127      0.49782      -1.0063".trim()

    for (i in 0..text.length - 1) {
        if (text[i] == ' ') {

/*            var j=i
         while (text[j]==' ')
             j++
            println(j)
         text.removeRange(i,j-1)
        }*/

            text.dropWhile { it == ' ' }
        }
    }
    println(text)


    var string = "ММ ММММММурзММ ММММММ ММММММик"
    string = string.dropWhile { it == 'М' }
    println(string)
    val index = string.indexOf(' ')
    println(index)
    string.removeRange(string.indexOf(' '), string.indexOf(' '))
}

